### NaN - means Not a Number

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# 通过numpy创建一个NaN
n = np.nan

In [5]:
type(n)

float

In [7]:
# 任何Number数据，与NaN做运算结果均为NaN
m = 1
m + n

nan

### NaN in Series

In [8]:
s1 = Series([1, 2, np.nan, 3, 4], index=['A', 'B', 'C', 'D', 'E'])

In [10]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [13]:
# isnull / notnull
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [15]:
# dorpna  
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

### NaN in DataFrame

In [16]:
dframe = DataFrame([[1, 2, 3], [np.nan, 5, 6], [7, np.nan, 9], [np.nan, np.nan, np.nan]])

In [18]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [20]:
dframe.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [31]:
# 判断行、列是否存在NaN数据项，存在即drop该行、列
df1 = dframe.dropna(axis=0, how='all')

In [32]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [29]:
df2 = dframe.dropna(axis=1, how='all')

In [30]:
#  列操作，只有列表中所有数据项为NaN时，才会进行drop操作
df2

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [33]:
dframe2 = DataFrame([[1, 2, 3], [np.nan, 5, 6], [7, np.nan, 9], [np.nan, np.nan, np.nan]])

In [35]:
dframe2

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [37]:
# thresh=2  NaN数据项存在数量 > 2 时，会进行drop操作
df2 = dframe2.dropna(thresh=2)

In [39]:
df2

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [46]:
# fillna() NaN数据项填充 默认按照列进行填充
df2.fillna(value={0:0, 1:-1, 2:-2})

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  7.0 -1.0  9.0

In [47]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [48]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0